{
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    9,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "Actinic Keratoses",
    "1": "Basal Cell Carcinoma",
    "2": "Benign Keratosis Like Lesions",
    "3": "Dermatofibroma",
    "4": "Melanoma",
    "5": "Melanocytic Nevi",
    "6": "Squamous Cell Carcinoma",
    "7": "Vascular Lesions"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Actinic Keratoses": 0,
    "Basal Cell Carcinoma": 1,
    "Benign Keratosis Like Lesions": 2,
    "Dermatofibroma": 3,
    "Melanoma": 4,
    "Melanocytic Nevi": 5,
    "Squamous Cell Carcinoma": 6,
    "Vascular Lesions": 7
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.52.4"
}
