{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "do_convert_rgb": null,
  "do_normalize": true,
  "do_rescale": true,
  "do_resize": true,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Benign Keratosis Like Lesions",
    "1": "Basal Cell Carcinoma",
    "2": "Actinic Keratoses",
    "3": "Vascular Lesions",
    "4": "Melanocytic Nevi",
    "5": "Melanoma",
    "6": "Dermatofibroma"
  },
  "image_mean": [
    0.5,
    0.5,
    0.5
  ],
  "image_processor_type": "ViTImageProcessor",
  "image_size": 224,
  "image_std": [
    0.5,
    0.5,
    0.5
  ],
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Actinic Keratoses": 2,
    "Basal Cell Carcinoma": 1,
    "Benign Keratosis Like Lesions": 0,
    "Dermatofibroma": 6,
    "Melanocytic Nevi": 4,
    "Melanoma": 5,
    "Vascular Lesions": 3
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "resample": 2,
  "rescale_factor": 0.00392156862745098,
  "size": {
    "height": 224,
    "width": 224
  },
  "torch_dtype": "float32",
  "transformers_version": "4.38.2"
}
